# На столе лежат n монеток. Некоторые из них лежат вверх решкой, а некоторые – гербом. 
# Определите минимальное число монеток, которые нужно перевернуть, чтобы все монетки были 
# повернуты вверх одной и той же стороной. Выведите минимальное количество монет, которые нужно перевернуть

# n=int(input("введите кол-во монет"))
# n0=int(input("сколько монет лежит решкой"))
# n1=n-n0
# if n0>n1:
#     print(f"нужно перевернуть {n1} монет")
# else:
#     print(f"нужно перевернуть {n0} монет")
# _____________________________________________________________________________
# Петя и Катя – брат и сестра. Петя – студент, а Катя – школьница. Петя помогает Кате по математике. 
# Он задумывает два натуральных числа X и Y (X,Y≤1000), а Катя должна их отгадать. Для этого Петя делает две подсказки. 
# Он называет сумму этих чисел S и их произведение P. Помогите Кате отгадать задуманные Петей числа.

# s=int(input())
# p=int(input())
# a1,a2=0,0
# for i in range(1,1000):
#     for j in range(1,1000):
#         if (i+j==s) and (i*j==p):
#             a1,a2=i,j
# print(f"загаданные числа {a1} и {a2}")
#_______________________________________________________________
# Требуется вывести все целые степени двойки (т.е. числа вида 2^k), 
# не превосходящие числа N.

# n=int(input())
# i=0
# while 2** i<=n:
#     print (2**i)
#     i+=1
    





